{
	"FormatVersion": 2,
	"Namespace": "",
	"Subnamespaces": [
		{
			"Namespace": "AnimationTools",
			"Children": [
				{
					"Source":
					{
						"Text": "Add New Entry"
					},
					"Translation":
					{
						"Text": "添加新片段"
					},
					"Key": "AddEntry"
				},
				{
					"Source":
					{
						"Text": "All Files (*.*)|*.*|CSV Files (*.csv)|*.csv"
					},
					"Translation":
					{
						"Text": "所有文件 (*.*)|*.*|CSV文件 (*.csv)|*.csv"
					},
					"Key": "OpenDialog.FileFilter"
				},
				{
					"Source":
					{
						"Text": "Animation Splitter"
					},
					"Translation":
					{
						"Text": "分割动画"
					},
					"Key": "WindowTitle"
				},
				{
					"Source":
					{
						"Text": "Animation clip name is empty"
					},
					"Translation":
					{
						"Text": "动画片段名称是空的"
					},
					"Key": "ErrorMsg.NameError"
				},
				{
					"Source":
					{
						"Text": "Are you sure to delete this entry?"
					},
					"Translation":
					{
						"Text": "你确认要删除此片段？"
					},
					"Key": "DeleteConfirm"
				},
				{
					"Source":
					{
						"Text": "CSV Files (*.csv)|*.csv"
					},
					"Translation":
					{
						"Text": "CSV文件 (*.csv)|*.csv"
					},
					"Key": "SaveDialog.FileFilter"
				},
				{
					"Source":
					{
						"Text": "Can`t open CSV file:{0}"
					},
					"Translation":
					{
						"Text": "无法打开CSV文件:{0}"
					},
					"Key": "ErrorMsg.CSVOpenFailed"
				},
				{
					"Source":
					{
						"Text": "Can`t save CSV file:{0}"
					},
					"Translation":
					{
						"Text": "无法保存CSV文件:{0}"
					},
					"Key": "ErrorMsg.CSVSaveFailed"
				},
				{
					"Source":
					{
						"Text": "Close"
					},
					"Translation":
					{
						"Text": "关闭"
					},
					"Key": "CloseButton"
				},
				{
					"Source":
					{
						"Text": "Close this window"
					},
					"Translation":
					{
						"Text": "关闭窗口"
					},
					"Key": "CloseTooltip"
				},
				{
					"Source":
					{
						"Text": "Delete this entry"
					},
					"Translation":
					{
						"Text": "删除此片段"
					},
					"Key": "DeleteEntryTooltip"
				},
				{
					"Source":
					{
						"Text": "End Frame"
					},
					"Translation":
					{
						"Text": "结束帧"
					},
					"Key": "EntryEndFrame"
				},
				{
					"Source":
					{
						"Text": "Export to CSV"
					},
					"Translation":
					{
						"Text": "导出为CSV"
					},
					"Key": "SaveCSVButton"
				},
				{
					"Source":
					{
						"Text": "Import from CSV"
					},
					"Translation":
					{
						"Text": "从CSV导入"
					},
					"Key": "OpenCSVButton"
				},
				{
					"Source":
					{
						"Text": "Invalid CSV format"
					},
					"Translation":
					{
						"Text": "CSV文件格式错误"
					},
					"Key": "ErrorMsg.CSVFormatError"
				},
				{
					"Source":
					{
						"Text": "Invalid end frame"
					},
					"Translation":
					{
						"Text": "结束帧超出范围"
					},
					"Key": "ErrorMsg.FrameError2"
				},
				{
					"Source":
					{
						"Text": "Invalid start frame"
					},
					"Translation":
					{
						"Text": "开始帧超出范围"
					},
					"Key": "ErrorMsg.FrameError1"
				},
				{
					"Source":
					{
						"Text": "Name"
					},
					"Translation":
					{
						"Text": "名称"
					},
					"Key": "EntryName"
				},
				{
					"Source":
					{
						"Text": "No selected Animation"
					},
					"Translation":
					{
						"Text": "未选中一个动画序列"
					},
					"Key": "ErrorMsg.AnimError"
				},
				{
					"Source":
					{
						"Text": "Open File"
					},
					"Translation":
					{
						"Text": "打开文件"
					},
					"Key": "OpenDialog.Title"
				},
				{
					"Source":
					{
						"Text": "Save File"
					},
					"Translation":
					{
						"Text": "保存文件"
					},
					"Key": "SaveDialog.Title"
				},
				{
					"Source":
					{
						"Text": "Save to directory:"
					},
					"Translation":
					{
						"Text": "保存到目录："
					},
					"Key": "SaveToDir"
				},
				{
					"Source":
					{
						"Text": "Split Animation"
					},
					"Translation":
					{
						"Text": "分割动画序列"
					},
					"Key": "split_anim"
				},
				{
					"Source":
					{
						"Text": "Split Animations"
					},
					"Translation":
					{
						"Text": "动画序列分割器"
					},
					"Key": "SplitButton"
				},
				{
					"Source":
					{
						"Text": "Split the selected animation into segments."
					},
					"Translation":
					{
						"Text": "将动画序列分割成多个"
					},
					"Key": "split_anim_desc"
				},
				{
					"Source":
					{
						"Text": "Start Frame"
					},
					"Translation":
					{
						"Text": "开始帧"
					},
					"Key": "EntryStartFrame"
				},
				{
					"Source":
					{
						"Text": "Succeed export to:{0}"
					},
					"Translation":
					{
						"Text": "成功导出到:{0}"
					},
					"Key": "ErrorMsg.CSVSaveSucceed"
				},
				{
					"Source":
					{
						"Text": "The end frame must be greater than or equal to the start frame"
					},
					"Translation":
					{
						"Text": "结束帧必须大于等于开始帧"
					},
					"Key": "ErrorMsg.FrameError3"
				}
			]
		}
	]
}